/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   map_parser.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: amayor <amayor@student.21-school.ru>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/24 13:48:41 by amayor            #+#    #+#             */
/*   Updated: 2020/10/24 13:50:32 by amayor           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../headers/libft.h"
#include "../headers/utils.h"

/*
* Общий обработчик строки карты. В зависимости строки вызывает нужный валидатор.
* Принимает указатель на строку и флаг линии - по нему опрделяется первая строка,
* последняя и все остальные.
* Возвращает код: 1 - ошибка, 0 - ОК
*/
int	map_handler(char *line, m_config **config)
{
	return (map_parser(line, config));
}
